### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
        id                             = "cataprato-core-lambda"
!       last_modified                  = "2023-08-09T15:02:53.883+0000" -> (known after apply)
!       layers                         = [] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-core-lambda:4" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-core-lambda:4/invocations" -> (known after apply)
!       s3_key                         = "lambda-builds/135a8e1fc66280c85f4b6818c445090a6544b6b0b8794ea98fe33ebe0b079a2e.zip" -> "lambda-builds/8a70fd95036ff5e124e41720c8eeb97a969dd1b671d04e5ad5178df36191b58c.zip"
+       s3_object_version              = (known after apply)
        tags                           = {}
!       version                        = "4" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       qualifier           = "4" -> (known after apply)
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "e8820ff957d2edff2de543774d77763f" -> (known after apply)
!       id                     = "lambda-builds/135a8e1fc66280c85f4b6818c445090a6544b6b0b8794ea98fe33ebe0b079a2e.zip" -> (known after apply)
!       key                    = "lambda-builds/135a8e1fc66280c85f4b6818c445090a6544b6b0b8794ea98fe33ebe0b079a2e.zip" -> "lambda-builds/8a70fd95036ff5e124e41720c8eeb97a969dd1b671d04e5ad5178df36191b58c.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "./.terraform/lambda-builds/135a8e1fc66280c85f4b6818c445090a6544b6b0b8794ea98fe33ebe0b079a2e.zip" -> "./.terraform/lambda-builds/8a70fd95036ff5e124e41720c8eeb97a969dd1b671d04e5ad5178df36191b58c.zip"
-       tags                   = {} -> null
!       tags_all               = {} -> (known after apply)
!       version_id             = "null" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "./.terraform/lambda-builds/"
+               build_plan    = [
+                   [
+                       "zip",
+                       "./dist/app",
+                       null,
                    ],
                ]
+               filename      = "./.terraform/lambda-builds/8a70fd95036ff5e124e41720c8eeb97a969dd1b671d04e5ad5178df36191b58c.zip"
+               runtime       = "nodejs18.x"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "./.terraform/lambda-builds/8a70fd95036ff5e124e41720c8eeb97a969dd1b671d04e5ad5178df36191b58c.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "4354352203426049391" -> (known after apply)
!       triggers = {
!           "filename"  = "./.terraform/lambda-builds/135a8e1fc66280c85f4b6818c445090a6544b6b0b8794ea98fe33ebe0b079a2e.zip" -> "./.terraform/lambda-builds/8a70fd95036ff5e124e41720c8eeb97a969dd1b671d04e5ad5178df36191b58c.zip"
!           "timestamp" = "1691593327101394000" -> "1691595461786048800"
        }
    }

  # module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
!       id       = "564311223214552" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "./.terraform/lambda-builds/135a8e1fc66280c85f4b6818c445090a6544b6b0b8794ea98fe33ebe0b079a2e.zip" -> "./.terraform/lambda-builds/8a70fd95036ff5e124e41720c8eeb97a969dd1b671d04e5ad5178df36191b58c.zip"
!           "original_source_code" = "\"./dist\"" -> "\"./dist/app\""
            # (3 unchanged elements hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] will be created
+   resource "aws_lambda_layer_version" "this" {
+       arn                         = (known after apply)
+       compatible_runtimes         = [
+           "nodejs18.x",
        ]
+       created_date                = (known after apply)
+       description                 = "Node_modules layer"
+       id                          = (known after apply)
+       layer_arn                   = (known after apply)
+       layer_name                  = "cataprato-core-layer-s3"
+       s3_bucket                   = "cataprato-core-20230809150239447600000001"
+       s3_key                      = "builds/24c4d91682ebcbeef89f1cef9efed19454c538860324721d87b794bf1b7c0697.zip"
+       s3_object_version           = (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
+       skip_destroy                = false
+       source_code_hash            = (known after apply)
+       source_code_size            = (known after apply)
+       version                     = (known after apply)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] will be created
+   resource "aws_s3_object" "lambda_package" {
+       acl                    = "private"
+       bucket                 = "cataprato-core-20230809150239447600000001"
+       bucket_key_enabled     = (known after apply)
+       content_type           = (known after apply)
+       etag                   = (known after apply)
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "builds/24c4d91682ebcbeef89f1cef9efed19454c538860324721d87b794bf1b7c0697.zip"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "builds/24c4d91682ebcbeef89f1cef9efed19454c538860324721d87b794bf1b7c0697.zip"
+       storage_class          = "ONEZONE_IA"
+       tags_all               = (known after apply)
+       version_id             = (known after apply)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "./dist/node",
+                       null,
                    ],
                ]
+               filename      = "builds/24c4d91682ebcbeef89f1cef9efed19454c538860324721d87b794bf1b7c0697.zip"
+               runtime       = ""
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/24c4d91682ebcbeef89f1cef9efed19454c538860324721d87b794bf1b7c0697.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] will be created
+   resource "null_resource" "archive" {
+       id       = (known after apply)
+       triggers = {
+           "filename"  = "builds/24c4d91682ebcbeef89f1cef9efed19454c538860324721d87b794bf1b7c0697.zip"
+           "timestamp" = "1691595461767560000"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] will be created
+   resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
+       id       = (known after apply)
+       triggers = {
+           "built_output_path"    = "builds/24c4d91682ebcbeef89f1cef9efed19454c538860324721d87b794bf1b7c0697.zip"
+           "original_source_code" = "\"./dist/node\""
+           "resource_name"        = "aws_lambda_layer_version.this[0]"
+           "resource_type"        = "LAMBDA_LAYER"
+           "source_code_property" = "path"
        }
    }

Plan: 10 to add, 1 to change, 4 to destroy.
```
</details>